cmsis-svd/cmsis-svd/data/Spansion/MB9BF32xS_svd.xml
        <!-- REGISTER "EPFR08" -->
        <register>
          <name>EPFR08</name>
          <description> register EPFR08 </description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK7B" -->
            <field>
              <name>SCK7B</name>
              <description> bitfield SCK7B </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT7B" -->
            <field>
              <name>SOT7B</name>
              <description> bitfield SOT7B </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN7S" -->
            <field>
              <name>SIN7S</name>
              <description> bitfield SIN7S </description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK6B" -->
            <field>
              <name>SCK6B</name>
              <description> bitfield SCK6B </description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT6B" -->
            <field>
              <name>SOT6B</name>
              <description> bitfield SOT6B </description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN6S" -->
            <field>
              <name>SIN6S</name>
              <description> bitfield SIN6S </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK5B" -->
            <field>
              <name>SCK5B</name>
              <description> bitfield SCK5B </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT5B" -->
            <field>
              <name>SOT5B</name>
              <description> bitfield SOT5B </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN5S" -->
            <field>
              <name>SIN5S</name>
              <description> bitfield SIN5S </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK4B" -->
            <field>
              <name>SCK4B</name>
              <description> bitfield SCK4B </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT4B" -->
            <field>
              <name>SOT4B</name>
              <description> bitfield SOT4B </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN4S" -->
            <field>
              <name>SIN4S</name>
              <description> bitfield SIN4S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTS4S" -->
            <field>
              <name>CTS4S</name>
              <description> bitfield CTS4S </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTS4E" -->
            <field>
              <name>RTS4E</name>
              <description> bitfield RTS4E </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR09" -->
        <register>
          <name>EPFR09</name>
          <description> register EPFR09 </description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F0FF03F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTX0E" -->
            <field>
              <name>CTX0E</name>
              <description> bitfield CTX0E </description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRX0S" -->
            <field>
              <name>CRX0S</name>
              <description> bitfield CRX0S </description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG1S" -->
            <field>
              <name>ADTRG1S</name>
              <description> bitfield ADTRG1S </description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADTRG0S" -->
            <field>
              <name>ADTRG0S</name>
              <description> bitfield ADTRG0S </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN0S" -->
            <field>
              <name>QZIN0S</name>
              <description> bitfield QZIN0S </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN0S" -->
            <field>
              <name>QBIN0S</name>
              <description> bitfield QBIN0S </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN0S" -->
            <field>
              <name>QAIN0S</name>
              <description> bitfield QAIN0S </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR10" -->
        <register>
          <name>EPFR10</name>
          <description> register EPFR10 </description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UEA24E" -->
            <field>
              <name>UEA24E</name>
              <description> bitfield UEA24E </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA23E" -->
            <field>
              <name>UEA23E</name>
              <description> bitfield UEA23E </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA22E" -->
            <field>
              <name>UEA22E</name>
              <description> bitfield UEA22E </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA21E" -->
            <field>
              <name>UEA21E</name>
              <description> bitfield UEA21E </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA20E" -->
            <field>
              <name>UEA20E</name>
              <description> bitfield UEA20E </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA19E" -->
            <field>
              <name>UEA19E</name>
              <description> bitfield UEA19E </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA18E" -->
            <field>
              <name>UEA18E</name>
              <description> bitfield UEA18E </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA17E" -->
            <field>
              <name>UEA17E</name>
              <description> bitfield UEA17E </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA16E" -->
            <field>
              <name>UEA16E</name>
              <description> bitfield UEA16E </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA15E" -->
            <field>
              <name>UEA15E</name>
              <description> bitfield UEA15E </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA14E" -->
            <field>
              <name>UEA14E</name>
              <description> bitfield UEA14E </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA13E" -->
            <field>
              <name>UEA13E</name>
              <description> bitfield UEA13E </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA12E" -->
            <field>
              <name>UEA12E</name>
              <description> bitfield UEA12E </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA11E" -->
            <field>
              <name>UEA11E</name>
              <description> bitfield UEA11E </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA10E" -->
            <field>
              <name>UEA10E</name>
              <description> bitfield UEA10E </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA09E" -->
            <field>
              <name>UEA09E</name>
              <description> bitfield UEA09E </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEA08E" -->
            <field>
              <name>UEA08E</name>
              <description> bitfield UEA08E </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEAOOE" -->
            <field>
              <name>UEAOOE</name>
              <description> bitfield UEAOOE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS7E" -->
            <field>
              <name>UECS7E</name>
              <description> bitfield UECS7E </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS6E" -->
            <field>
              <name>UECS6E</name>
              <description> bitfield UECS6E </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS5E" -->
            <field>
              <name>UECS5E</name>
              <description> bitfield UECS5E </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS4E" -->
            <field>
              <name>UECS4E</name>
              <description> bitfield UECS4E </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS3E" -->
            <field>
              <name>UECS3E</name>
              <description> bitfield UECS3E </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS2E" -->
            <field>
              <name>UECS2E</name>
              <description> bitfield UECS2E </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECS1E" -->
            <field>
              <name>UECS1E</name>
              <description> bitfield UECS1E </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEFLSE" -->
            <field>
              <name>UEFLSE</name>
              <description> bitfield UEFLSE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEOEXE" -->
            <field>
              <name>UEOEXE</name>
              <description> bitfield UEOEXE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDQME" -->
            <field>
              <name>UEDQME</name>
              <description> bitfield UEDQME </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEWEXE" -->
            <field>
              <name>UEWEXE</name>
              <description> bitfield UEWEXE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECLKE" -->
            <field>
              <name>UECLKE</name>
              <description> bitfield UECLKE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDTHB" -->
            <field>
              <name>UEDTHB</name>
              <description> bitfield UEDTHB </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDEFB" -->
            <field>
              <name>UEDEFB</name>
              <description> bitfield UEDEFB </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
