cmsis-svd/cmsis-svd/data/Spansion/MB9BF32xS_svd.xml
        <!-- REGISTER "WIER" -->
        <register>
          <name>WIER</name>
          <description> register WIER </description>
          <addressOffset>0x70C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x03FB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCEC1E" -->
            <field>
              <name>WCEC1E</name>
              <description> bitfield WCEC1E </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCEC0E" -->
            <field>
              <name>WCEC0E</name>
              <description> bitfield WCEC0E </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI5E" -->
            <field>
              <name>WUI5E</name>
              <description> bitfield WUI5E </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI4E" -->
            <field>
              <name>WUI4E</name>
              <description> bitfield WUI4E </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI3E" -->
            <field>
              <name>WUI3E</name>
              <description> bitfield WUI3E </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2E" -->
            <field>
              <name>WUI2E</name>
              <description> bitfield WUI2E </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1E" -->
            <field>
              <name>WUI1E</name>
              <description> bitfield WUI1E </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WLVDE" -->
            <field>
              <name>WLVDE</name>
              <description> bitfield WLVDE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRTCE" -->
            <field>
              <name>WRTCE</name>
              <description> bitfield WRTCE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WILVR" -->
        <register>
          <name>WILVR</name>
          <description> register WILVR </description>
          <addressOffset>0x710</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI5LV" -->
            <field>
              <name>WUI5LV</name>
              <description> bitfield WUI5LV </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI4LV" -->
            <field>
              <name>WUI4LV</name>
              <description> bitfield WUI4LV </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI3LV" -->
            <field>
              <name>WUI3LV</name>
              <description> bitfield WUI3LV </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2LV" -->
            <field>
              <name>WUI2LV</name>
              <description> bitfield WUI2LV </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1LV" -->
            <field>
              <name>WUI1LV</name>
              <description> bitfield WUI1LV </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSRAMR" -->
        <register>
          <name>DSRAMR</name>
          <description> register DSRAMR </description>
          <addressOffset>0x714</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRAMR" -->
            <field>
              <name>SRAMR</name>
              <description> bitfield SRAMR </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BUR01" -->
        <register>
          <name>BUR01</name>
          <description> register BUR01 </description>
          <addressOffset>0x800</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR02" -->
        <register>
          <name>BUR02</name>
          <description> register BUR02 </description>
          <addressOffset>0x801</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR03" -->
        <register>
          <name>BUR03</name>
          <description> register BUR03 </description>
          <addressOffset>0x802</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR04" -->
        <register>
          <name>BUR04</name>
          <description> register BUR04 </description>
          <addressOffset>0x803</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR05" -->
        <register>
          <name>BUR05</name>
          <description> register BUR05 </description>
          <addressOffset>0x804</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR06" -->
        <register>
          <name>BUR06</name>
          <description> register BUR06 </description>
          <addressOffset>0x805</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
