cmsis-svd/cmsis-svd/data/Spansion/MB9BF32xS_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "EXBUS" -->
    <peripheral>
      <name>EXBUS</name>
      <description> peripheral EXBUS </description>
      <groupName>EXBUS</groupName>
      <baseAddress>0x4003F000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x300</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MODE0" -->
        <register>
          <name>MODE0</name>
          <description> register MODE0 </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3BFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOEXEUP" -->
            <field>
              <name>MOEXEUP</name>
              <description> bitfield MOEXEUP </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXCSOF" -->
            <field>
              <name>MPXCSOF</name>
              <description> bitfield MPXCSOF </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXDOFF" -->
            <field>
              <name>MPXDOFF</name>
              <description> bitfield MPXDOFF </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALEINV" -->
            <field>
              <name>ALEINV</name>
              <description> bitfield ALEINV </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXMODE" -->
            <field>
              <name>MPXMODE</name>
              <description> bitfield MPXMODE </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SHRTDOUT" -->
            <field>
              <name>SHRTDOUT</name>
              <description> bitfield SHRTDOUT </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description> bitfield RDY </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAGE" -->
            <field>
              <name>PAGE</name>
              <description> bitfield PAGE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NAND" -->
            <field>
              <name>NAND</name>
              <description> bitfield NAND </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WEOFF" -->
            <field>
              <name>WEOFF</name>
              <description> bitfield WEOFF </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBMON" -->
            <field>
              <name>RBMON</name>
              <description> bitfield RBMON </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDTH" -->
            <field>
              <name>WDTH</name>
              <description> bitfield WDTH </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MODE1" -->
        <register derivedFrom="MODE0">
          <name>MODE1</name>
          <description> register MODE1 </description>
          <addressOffset>0x4</addressOffset>
        </register>
        <!-- REGISTER "MODE2" -->
        <register derivedFrom="MODE0">
          <name>MODE2</name>
          <description> register MODE2 </description>
          <addressOffset>0x8</addressOffset>
        </register>
        <!-- REGISTER "MODE3" -->
        <register derivedFrom="MODE0">
          <name>MODE3</name>
          <description> register MODE3 </description>
          <addressOffset>0xC</addressOffset>
        </register>
        <!-- REGISTER "MODE4" -->
        <register derivedFrom="MODE0">
          <name>MODE4</name>
          <description> register MODE4 </description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "MODE5" -->
        <register derivedFrom="MODE0">
          <name>MODE5</name>
          <description> register MODE5 </description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "MODE6" -->
        <register derivedFrom="MODE0">
          <name>MODE6</name>
          <description> register MODE6 </description>
          <addressOffset>0x18</addressOffset>
        </register>
        <!-- REGISTER "MODE7" -->
        <register derivedFrom="MODE0">
          <name>MODE7</name>
          <description> register MODE7 </description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <!-- REGISTER "TIM0" -->
        <register>
          <name>TIM0</name>
          <description> register TIM0 </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x055FF00F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WIDLC" -->
            <field>
              <name>WIDLC</name>
              <description> bitfield WIDLC </description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WWEC" -->
            <field>
              <name>WWEC</name>
              <description> bitfield WWEC </description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WADC" -->
            <field>
              <name>WADC</name>
              <description> bitfield WADC </description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WACC" -->
            <field>
              <name>WACC</name>
              <description> bitfield WACC </description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIDLC" -->
            <field>
              <name>RIDLC</name>
              <description> bitfield RIDLC </description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRADC" -->
            <field>
              <name>FRADC</name>
              <description> bitfield FRADC </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RADC" -->
            <field>
              <name>RADC</name>
              <description> bitfield RADC </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RACC" -->
            <field>
              <name>RACC</name>
              <description> bitfield RACC </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIM1" -->
        <register derivedFrom="TIM0">
          <name>TIM1</name>
          <description> register TIM1 </description>
          <addressOffset>0x24</addressOffset>
        </register>
